[
  {
    "id": "959669b6-00ab-45fe-883b-dc9bd59bee4f",
    "title": "Dom Casmurro",
    "thumbnailUrl": "https://images-na.ssl-images-amazon.com/images/I/41GeyYROqTL._SX346_BO1,204,203,200_.jpg",
    "price": 48.0,
    "longDescription": "Prometido para o seminário desde o nascimento, o jovem carioca Bentinho precisa encontrar um jeito de fugir da vida na Igreja e realizar seu verdadeiro sonho: casar-se com a  Capitu história de paixão, obsessão e ciúme se desenrola, em uma narrativa cheia de reviravoltas, que aos poucos constrói um retrato da sociedade brasileira. Com este romance publicado em 1899, o maior nome da literatura nacional, Machado de Assis, torna-se também parte do cânone mundial. Dom Casmurro traz contundentes reflexões sobre o Brasil de sua  ainda muito relevantes para os dias atuais, e faz isso com a narrativa repleta de ironia que é uma marca do autor. A nova edição da Antofágica traz o texto integral de Machado com notas e posfácio do especialista Rogério Fernandes dos Santos, além de ilustrações de Paula Siebra, apresentação da produtora  Camilla Dias e posfácios da atriz e escritora Maria Ribeiro do escritor Geovani Martins.",
    "authors": ["Machado De Assis"],
    "pageCount": 208,
    "publishingCompany": "Principis",
    "publishedDate": "02 maio 2019",
    "language": "Português"
  },
  {
    "id": "895c4372-2928-4299-a8a6-14709fbfe45a",
    "title": "Memórias póstumas de Brás Cubas",
    "thumbnailUrl": "https://images-na.ssl-images-amazon.com/images/I/51rEMmmweAL._SX346_BO1,204,203,200_.jpg",
    "price": 9.95,
    "longDescription": "Não tive filhos, não transmiti a nenhuma criatura o legado da nossa miséria. Com essas palavras, o narrador de Memórias Póstumas de Brás Cubas resume a sua vida. O tom assumido na obra, bem como as técnicas empregadas na composição romanesca, são alguns dos fatores que justificam o lugar de Machado de Assis entre os maiores escritores do século XIX. Neste romance repleto de digressões filosóficas, o escritor se vale da posição privilegiada de Brás Cubas, que, como defunto autor, narra as suas desventuras e revela as contradições da sociedade brasileira do século XIX, por meio de uma análise aprofundada de seus personagens.",
    "authors": ["Machado De Assis"],
    "pageCount": 192,
    "publishingCompany": "Principis",
    "publishedDate": "02 maio 2019",
    "language": "Português"
  },
  {
    "id": "34ab3027-67bc-4e11-8d68-6c3c9fdff20e",
    "title": "O cortiço",
    "thumbnailUrl": "https://images-na.ssl-images-amazon.com/images/I/41IJk85OQ-L._SX344_BO1,204,203,200_.jpg",
    "price": 31.32,
    "longDescription": "Aluísio Azevedo retrata as péssimas condições de vida dos moradores dos cortiços cariocas neste romance estrelado por dois imigrantes portugueses. A linguagem rebuscada do autor naturalista do século XIX é traduzida para os dias de hoje por meio das notas comentadas de Fátima Mesquita.",
    "authors": ["Aluísio Azevedo "],
    "pageCount": 224,
    "publishingCompany": "Panda Books",
    "publishedDate": "1 março 2017",
    "language": "Português"
  },
  {
    "id": "8a78d590-6c80-4b10-b938-78f9868e4ed1",
    "title": "Iracema",
    "thumbnailUrl": "https://images-na.ssl-images-amazon.com/images/I/51qMQyfJrEL._SX359_BO1,204,203,200_.jpg",
    "price": 22.89,
    "longDescription": "Ceará, século XVII. Você está prestes a conhecer uma das historias de amor mais aclamadas da literatura brasileira. O herói branco, europeu, apaixona-se pela linda Iracema, “a virgem dos lábios de mel”. Mais que doçura, a bela guarda o valioso segredo da jurema, que lhe cobra, total castidade. O amor, porém, não conhece segredos; tem seus próprios mistérios. No enredo, um conflito histórico entre tribos indígenas permeia a narrativa, tecendo uma parábola ao mesmo tempo trágica e poética da origem do povo brasileiro.",
    "authors": ["José de Alencar"],
    "pageCount": 168,
    "publishingCompany": "Melhoramentos",
    "publishedDate": "11 julho 2012",
    "language": "Português"
  },
  {
    "id": "683c45bc-07ab-4b27-a6c6-9cbcdde8b226",
    "title": "Vidas secas",
    "thumbnailUrl": "https://images-na.ssl-images-amazon.com/images/I/41RHln7kZoL._SX321_BO1,204,203,200_.jpg",
    "price": 28.59,
    "longDescription": "Vidas secas é reconhecidamente o mais importante livro de Graciliano Ramos e um dos maiores clássicos da literatura brasileira. Graciliano Ramos nasceu em 1892, no interior de Alagoas, e cresceu na fazenda do pai antes de se mudar para a capital do estado e, posteriormente, para o Rio de Janeiro, onde começou a trabalhar na imprensa. Em 1937, foi preso sob vagas acusações de defender ideologias comunistas. Ao deixar a prisão, procurou trabalho como jornalista em um jornal do Rio de Janeiro. O editor então lhe permitiu publicar um texto curto, e Graciliano escreveu um conto chamado “Baleia”, sobre o sofrimento e a morte da cachorrinha de uma família de retirantes sertanejos. O conto fez sucesso e o jornal encomendou outros no mesmo estilo. Graciliano produziu então um conto para cada membro da família: o pai, a mãe e os dois filhos. Nascia assim Vidas secas, narrado em terceira pessoa, com treze capítulos que, por não terem uma linearidade temporal, podem ser lidos fora de ordem, como contos.Lançado originalmente em 1938, Vidas secas retrata a vida miserável de uma família de retirantes sertanejos obrigada a se deslocar de tempos em tempos para áreas menos castigadas pela seca. O pai, Fabiano, caminha pela paisagem árida da caatinga do Nordeste brasileiro com a sua mulher, Sinha Vitória, e os dois filhos, que não têm nome, sendo chamados apenas de “filho mais velho” e “filho mais novo”. São também acompanhados pela cachorrinha da família, Baleia, cujo nome é irônico, pois a falta de comida a fez muito magra.Vidas secas pertence à segunda fase modernista da literatura brasileira, conhecida como “regionalista” ou “romance de 30”. Denuncia fortemente as mazelas do povo brasileiro, principalmente a situação de miséria do sertão nordestino. É o romance em que Graciliano alcança o máximo da expressão que vinha buscando em sua prosa: o que impulsiona os personagens é a seca, áspera e cruel, e paradoxalmente a ligação telúrica, afetiva, que expõe naqueles seres em retirada, à procura de meios de sobrevivência e um futuro.",
    "authors": ["Graciliano Ramos"],
    "pageCount": 176,
    "publishingCompany": "Record",
    "publishedDate": "4 fevereiro 2019",
    "language": "Português"
  }
]
